app/views/teams/show.html.erb

SELECT  "players".* FROM "players" WHERE "players"."team_id" = $1 ORDER BY "players"."id" ASC LIMIT $2  [["team_id", 1], ["LIMIT", 1]]
---
  <strong>Jugadores:</strong>
  <% @team.players.each do |player| %>