app/views/tournaments/_form.html.erb

    <%= f.label "Participantes" %>
      <%= f.collection_check_boxes :team_ids, Team.all, :id, :nombre %>
---
SELECT "teams".* FROM "teams"