app/views/tournaments/index.html.erb

        <td><%= dict_tipo[tournament.tipo]  %></td>
        <td><%= tournament.team_ids.length  %></td>
---
SELECT "teams".id FROM "teams" INNER JOIN "teams_tournaments" ON "teams"."id" = "teams_tournaments"."team_id" WHERE "teams_tournaments"."tournament_id" = $1  [["tournament_id", 1]]