app/views/tournaments/show.html.erb

  <strong>Participantes:</strong>
  <% @tournament.teams.each do |team| %>
---
SELECT  "teams".* FROM "teams" INNER JOIN "teams_tournaments" ON "teams"."id" = "teams_tournaments"."team_id" WHERE "teams_tournaments"."tournament_id" = $1 ORDER BY "teams"."id" ASC LIMIT $2  [["tournament_id", 4], ["LIMIT", 1]]