app/views/players/_form.html.erb

SELECT "teams".* FROM "teams"
---
    <%= f.label :team_id, "Equipo" %>
    <%= f.select :team_id, Team.all.collect { |t| [ t.nombre, t.id ] }, { selected: @team.id }, {disabled: true} %>