app/views/players/show.html.erb

  <strong>Equipo: (ID - nombre)</strong>
  <%= @player.team_id.to_s + " - " + Team.find_by_id(@player.team_id).nombre %>
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]