app/views/matches/_form.html.erb

SELECT "tournaments".* FROM "tournaments"
---
    <%= f.label :tournament_id, 'Campeonato' %>
    <%= f.select :tournament_id, Tournament.all.collect { |t| [ t.nombre, t.id ] }, { selected: @tournament.id }, {disabled: true} %>

SELECT "teams".id FROM "teams" INNER JOIN "teams_tournaments" ON "teams"."id" = "teams_tournaments"."team_id" WHERE "teams_tournaments"."tournament_id" = $1  [["tournament_id", 1]]
---
    <%= f.label :equipo_local_id %>
    <%= f.select :equipo_local_id, @tournament.teams.collect { |t| [ t.nombre, t.id ] }, { include_blank: 'Equipo Local' }, { required: true } %>