app/controllers/matches_controller.rb

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @tournament = Tournament.find(params[:tournament_id])

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @match = Match.new
    @tournament = Tournament.find(params[:tournament_id])

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "matches" ("fecha", "equipo_local_id", "equipo_visita_id", "created_at", "updated_at", "tournament_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["fecha", 2017-05-01 00:41:00 UTC], ["equipo_local_id", 1], ["equipo_visita_id", 2], ["created_at", 2017-05-01 00:41:55 UTC], ["updated_at", 2017-05-01 00:41:55 UTC], ["tournament_id", 1]]
---
  def create
    @tournament = Tournament.find(params[:tournament_id])
    @match = @tournament.matches.new(match_params)
    respond_to do |format|

    if @match.save

UPDATE "matches" SET "equipo_visita_id" = $1, "updated_at" = $2 WHERE "matches"."id" = $3  [["equipo_visita_id", 1], ["updated_at", 2017-05-01 01:14:12 UTC], ["id", 8]]
---
  def update

    respond_to do |format|
      if @match.update(match_params)

DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 2]]
---
  def destroy
    @match.destroy

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_match
      @match = Match.find(params[:id])
      @tournament = Tournament.find(params[:tournament_id])