app/controllers/players_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @team = Team.find(params[:team_id])

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @team = Team.find(params[:team_id])

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "players" ("nombre", "apellido", "nacionalidad", "edad", "created_at", "updated_at", "team_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["nombre", "calule "], ["apellido", "melendez"], ["nacionalidad", "chile"], ["edad", 80], ["created_at", 2017-04-28 05:10:23 UTC], ["updated_at", 2017-04-28 05:10:23 UTC], ["team_id", 1]]
---
  def create
    @team = Team.find(params[:team_id])
    @player = @team.players.new(player_params)

    respond_to do |format|
      if @player.save

UPDATE "players" SET "apellido" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["apellido", "pitersadalsdxDDd"], ["updated_at", 2017-04-30 22:04:30 UTC], ["id", 76]]
---
  def update
    respond_to do |format|
      if @player.update(player_params)

DELETE FROM "players" WHERE "players"."id" = $1  [["id", 71]]
---
  def destroy
    @player.destroy

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 76], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_player
      @player = Player.find(params[:id])
      @team = Team.find(params[:team_id])