app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("nombre", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre", "Colo Colo"], ["country", "Chile"], ["created_at", 2017-04-30 05:17:58 UTC], ["updated_at", 2017-04-30 05:17:58 UTC]]