app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def index
    @tournaments = Tournament.all

SELECT  "teams".* FROM "teams" INNER JOIN "teams_tournaments" ON "teams"."id" = "teams_tournaments"."team_id" WHERE "teams_tournaments"."tournament_id" = $1 ORDER BY "teams"."id" ASC LIMIT $2  [["tournament_id", 4], ["LIMIT", 1]]
---
                      partidos_jugados: partidos_jugados}
      @tabla = Hash[ @tabla.sort_by { |key, val| [val[:puntos], val[:goles_favor]-val[:goles_contra], val[:goles_favor]] }.reverse ]
     Rails.logger.debug("My object: #{@tabla.inspect}")
     @ganador = @tournament.teams.find_by_id(@tabla.max_by{|k,v| v[:puntos]}[0]).nombre

INSERT INTO "tournaments" ("nombre", "tipo", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "asd"], ["tipo", 1], ["created_at", 2017-05-14 07:37:57 UTC], ["updated_at", 2017-05-14 07:37:57 UTC], ["user_id", 1]]
---
  def create
    @tournament = Tournament.new(tournament_params)
    respond_to do |format|
      if @tournament.save

DELETE FROM "tournaments" WHERE "tournaments"."id" = $1  [["id", 1]]
---
  def destroy
    @tournament.destroy

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def set_tournament
      @tournament = Tournament.find(params[:id])