app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "isfecave@gmail.com"], ["first_name", "asd"], ["last_name", "adasd"], ["password", "asdfasdf"], ["created_at", 2017-05-01 01:49:08 UTC], ["updated_at", 2017-05-01 01:49:08 UTC]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save